#include <iostream>

using namespace std;

const int cir = 20; // цепи
const int elem = 14; // элементы
const int matr[cir][elem] =     // матрица инцидентности 20 х 14
{//элементы:                                               // цепи: 
	         { 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0 }, // 1
	         { 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0 }, // 2
	         { 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1 }, // 3
	         { 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0 }, // 4
	         { 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0 }, // 5
	         { 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1 }, // 6
	         { 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0 }, // 7
	         { 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0 }, // 8 
	         { 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0 }, // 9 
	         { 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1 }, // 10 
	         { 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0 }, // 11 
	         { 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0 }, // 12
	         { 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1 }, // 13
	         { 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1 }, // 14
	         { 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0 }, // 15
	         { 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1 }, // 16
	         { 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 17
	         { 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1 }, // 18
	         { 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1 }, // 19
	         { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1 }, // 20
};

int main() {

	setlocale(LC_ALL, "Russian");

	cout << "Матрица инцидентности: " << endl;
	for (int i = 0; i < cir; i++) {
		for (int j = 0; j < elem; j++) {
			cout << matr[i][j] << " ";
		}
		cout << endl;
	}
	cout << endl;

	int size1, size2;
	cout << "Введите размер первой группы "; cin >> size1;
	size2 = elem - size1;

	int ans = 0;
	int numl = 0, numr = 0;
	for (int i = 0; i < cir; i++) {
		numl = numr = 0;
		for (int j = 0; j < elem; j++) {
			if (matr[i][j] == 1) {
				if (j < size1)
					numl++;
				else
					numr++;
			}
		}
		if (numl != 0 && numr != 0) ans++;
		// cout << numl << " " << numr << endl;
	}
	cout << "Число элементов имеющих цепи попавшие в разрез " << ans;

	return 0;
}